{
  "projects": [
    {
      "date": "27/08/2024",
      "title": "quIET",
      "description": "quIET is an anonymous social media platform designed to let users freely express their thoughts and opinions without revealing their true identity. In an era where maintaining a public image can be challenging. Each user is assigned a randomly generated username, ensuring that personal details like names and email addresses remain confidential. The platform is powered by PostgreSQL with Prisma, React, Express, Node.js, and hosted on Microsoft Azure.",
      "url": "https://www.bequiet.live/",
      "imgSrc": "https://i.postimg.cc/zBSsVMzp/Screenshot-2024-08-27-222017.png"
    },
    {
      "date": "11/04/2024",
      "title": "Crypto Canvas",
      "description": "Crypto Canvas is a dynamic web application designed to provide real-time data on various cryptocurrencies. Leveraging the CoinGecko API, the app fetches live cryptocurrency data and displays it using React.js, React Chart, and Chakra UI for enhanced visualization and user interface design.",
      "url": "https://mycryptocanvas.vercel.app/",
      "imgSrc": "https://i.postimg.cc/HkPJgJv7/Screenshot-2024-04-19-010518.png"
    },

    {
      "date": "19/03/2024",
      "title": "Key Chroma",
      "description": "Key Chroma is a user-friendly password manager web application built to securely store usernames, passwords, and website URLs locally. Developed using React.js and styled with Tailwind CSS, SecurePass offers a streamlined and intuitive interface for managing sensitive login information.",
      "url": "https://keychroma.vercel.app/",
      "imgSrc": "https://i.postimg.cc/CK0w9kbN/Screenshot-2024-04-19-013731.png"
    },

    {
      "date": "29/02/2024",
      "title": "Spotify Clone",
      "description": "SpotiClone is a dynamic web application that replicates some functionality of Spotify, allowing users to play songs directly from their browser. Developed using HTML, CSS, and JavaScript, SpotiClone fetches songs from a local song folder using the Fetch API, providing users with a seamless music streaming experience.",
      "url": "https://riturajmusicplayer.freewebhostmost.com",
      "imgSrc": "https://i.postimg.cc/SRnw5xRq/Screenshot-2024-04-19-014158.png"
    }
  ],
  "skills": [
    {
      "title": "Full-Stack Development Expertise",
      "description": "Experienced in building full-stack applications using modern frameworks and libraries. Proficient in front-end technologies like React.js and Next.js for creating interactive UIs, with expertise in state management (e.g., Redux, Context API). Back-end development skills include using Express.js, Node.js, and integrating RESTful APIs for efficient communication between the front-end and back-end."
    },
    {
      "title": "Data Structures and Algorithms",
      "description": "Experience with data structures such as arrays, linked lists, stacks, queues, trees, and graphs. Expertise in algorithm design techniques like recursion, sorting, searching, and dynamic programming. Strong problem-solving skills with a focus on optimizing solutions for time and space complexity."
    },
    {
      "title": "DevOps and Cloud Technologies",
      "description": "Hands-on experience with CI/CD pipelines using Jenkins and GitHub Actions for automated builds and deployments. Skilled in deploying and managing applications on AWS EC2 and Azure. Expertise in using AWS S3 for secure file storage and managing containerized applications with Docker and NGINX as a reverse proxy."
    },
    
    {
      "title": "Languages",
      "description": "Proficient in Java for object-oriented programming and data structures, JavaScript with ES6+ features for dynamic web applications, and SQL for efficient database design and querying."
    },
    {
      "title": "Database Design and Management",
      "description": "Proficient in working with both NoSQL and relational databases. Expertise in MongoDB for NoSQL database management, including schema design, querying, indexing, and performance optimization. Strong knowledge of relational databases like PostgreSQL and MySQL, focusing on database design, normalization, and SQL querying. Experience with ORM tools like Prisma for efficient database interaction and management."
    },
    {
      "title": "Version Control",
      "description": "Proficiency in Git and GitHub for version control and collaborative development."
    }
  ],
  "aboutme": [
    "Hello! I'm Rituraj Singh, a passionate full-stack developer with a growing focus on DevOps practices and competitive programming. With a Bachelor's degree in Science (Mathematics) and currently pursuing a Master's in Computer Applications at the Institute of Engineering and Technology, Lucknow, I am committed to bridging development and operational excellence in the ever-evolving digital landscape.",

    "Throughout my academic and professional journey, I have honed my problem-solving skills in data structures and algorithms on platforms like CodeChef and LeetCode. My experience includes building robust, scalable applications like quIET, an anonymous social media platform, and KeyChroma, a secure password management system. Additionally, I have leveraged AWS S3 for secure and efficient file storage solutions.",

    "Beyond development, I have hands-on experience with DevOps tools and workflows, including automating CI/CD pipelines using Jenkins and GitHub Actions, deploying scalable applications on AWS EC2 and Azure, and managing containerized environments with Docker and NGINX as a reverse proxy. These practices enable me to ensure seamless deployments and operational efficiency.",

    "When not coding or configuring pipelines, I enjoy diving into algorithmic challenges and exploring innovative ways to push technological boundaries. I am excited to collaborate with like-minded individuals to solve complex challenges and drive meaningful contributions in the tech industry."
  ]
}
