{
    "projects": [
      {
        "date": "27/08/2024",
        "title": "quIET",
        "description": "quIET is an anonymous social media platform designed to let users freely express their thoughts and opinions without revealing their true identity. In an era where maintaining a public image can be challenging. Each user is assigned a randomly generated username, ensuring that personal details like names and email addresses remain confidential. The platform is powered by PostgreSQL with Prisma, React, Express, Node.js, and hosted on Microsoft Azure.",
        "url": "https://www.bequiet.live/",
        "imgSrc": "https://res.cloudinary.com/dby3ovl1f/image/upload/v1724777475/main/1724777472981.png"
      },
      {
        "date": "11/04/2024",
        "title": "Crypto Canvas",
        "description": "Crypto Canvas is a dynamic web application designed to provide real-time data on various cryptocurrencies. Leveraging the CoinGecko API, the app fetches live cryptocurrency data and displays it using React.js, React Chart, and Chakra UI for enhanced visualization and user interface design.",
        "url": "https://mycryptocanvas.vercel.app/",
        "imgSrc": "https://i.postimg.cc/HkPJgJv7/Screenshot-2024-04-19-010518.png"
      },
  
      {
        "date": "19/03/2024",
        "title": "Key Chroma",
        "description": "Key Chroma is a user-friendly password manager web application built to securely store usernames, passwords, and website URLs locally. Developed using React.js and styled with Tailwind CSS, SecurePass offers a streamlined and intuitive interface for managing sensitive login information.",
        "url": "https://keychroma.vercel.app/",
        "imgSrc": "https://i.postimg.cc/CK0w9kbN/Screenshot-2024-04-19-013731.png"
      },
      
      {
        "date": "29/02/2024",
        "title": "Spotify Clone",
        "description": "SpotiClone is a dynamic web application that replicates some functionality of Spotify, allowing users to play songs directly from their browser. Developed using HTML, CSS, and JavaScript, SpotiClone fetches songs from a local song folder using the Fetch API, providing users with a seamless music streaming experience.",
        "url": "https://riturajsingh.freewebhostmost.com/",
        "imgSrc": "https://i.postimg.cc/SRnw5xRq/Screenshot-2024-04-19-014158.png"
      }
      
    ],
    "skills":[
      {
        "title":"Data Structures and Algorithms Using Java ",
        "description":"Experience with data structures such as arrays, linked lists, stacks, queues, trees, and graphs. Knowledge in algorithm design techniques like recursion, sorting, searching, and dynamic programming. Problem-solving skills and ability to optimize solutions for time and space complexity."
      },
      {
        "title":"JavaScript",
        "description":"Command in JavaScript language fundamentals, experience with asynchronous programming, promises, and callbacks.Familiarity with ES6+ features such as arrow functions, template literals, and destructuring."
      },
      {
        "title":"CSS Preprocessors and Styling Libraries",
        "description":"Expertise in Sass (Syntactically Awesome Style Sheets) for efficient and maintainable CSS. Familiarity with Chakra UI and Tailwind CSS for rapid UI development. Ability to create responsive and visually appealing designs using CSS frameworks."
      },
      {
        "title":"MERN Stack",
        "description":"Knowledge in MongoDB, Express.js, React.js, Node.js, RESTful APIs and CRUD operations."
      },
      
      
      
      {
        "title":"Front-End Frameworks",
        "description":"Command in React.js and Next.js for building interactive user interfaces. Understanding of component-architecture and state management (e.g., Redux, Context API).Knowledge of React hooks and functional components."
      },
      {
        "title":"Version Control",
        "description":"Proficiency in Git and GitHub for version control and collaborative development."
      }
  ],
  "aboutme":["Hello! I'm Rituraj Singh, a dedicated MERN stack developer and enthusiast for all things web development and competitive programming. With a Bachelor's degree in Science(Mathematics) and currently pursuing a Master's in Computer Application from Institute of Engineering and Technology, Lucknow , I've embarked on a journey to push the boundaries of what's possible in the digital world.","My passion for coding is currently blossoming during my college years, where I am delving into the intricacies of data structures and algorithms while mastering the art of problem-solving. I am thriving on the challenge of optimizing solutions for time and space efficiency, honing my skills on platforms like Codechef and LeetCode.","But it's not just about the code – I have a keen eye for design and usability, harnessing the capabilities of CSS preprocessors like Sass and modern UI frameworks like Chakra UI and Tailwind CSS to create visually stunning and user-friendly experiences.","In my free time, you'll often find me diving into algorithmic challenges, refining my skills, and seeking out new opportunities for growth. I believe that continuous learning is the key to staying ahead in this ever-evolving field, and I'm committed to staying at the forefront of technological innovation.","As I embark on the next chapter of my journey, I'm excited to collaborate with like-minded individuals and organizations to tackle new challenges, push the boundaries of what's possible, and make a meaningful impact in the world of technology."]
    
  }